Revit 2027 API
BuiltInFailures.FamilyFailures.DuplicateTypeName Property
 "Ignoring attempt to add family type '%1!s!' for a second time."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateTypeName { get; }
Public Shared ReadOnly Property DuplicateTypeName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateTypeName {
	FailureDefinitionId^ get ();
}
static member DuplicateTypeName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace